### STATES

In [27]:
import numpy as np
import pandas as pd
import datetime as dt
import os 

from config import pwd, uname

# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func
from sqlalchemy import Column, Integer, String, Float 
from sqlalchemy import desc

In [28]:
# create engine to postgres db
postgres = f'postgresql://{uname}:{pwd}@localhost:5432/etl_project'  #path to local db
engine = create_engine(postgres)

In [29]:
# reflect an existing database into a new model
base = automap_base()
# reflect the tables
base.prepare(engine, reflect=True)
# View all of the classes that automap found
base.classes.keys()

['ca_raw', 'co_raw', 'sales_by_qtr', 'states', 'mass_raw', 'census']

In [30]:
state_name_df=pd.read_csv("../DataSets/State Names and Abbr.csv")
state_name_df.head()

        State  Abbrev Code
0     Alabama    Ala.   AL
1      Alaska  Alaska   AK
2     Arizona   Ariz.   AZ
3    Arkansas    Ark.   AR
4  California  Calif.   CA

In [31]:
state_name_df=state_name_df.drop('Abbrev', 1)
state_name_df.head()

        State Code
0     Alabama   AL
1      Alaska   AK
2     Arizona   AZ
3    Arkansas   AR
4  California   CA

In [32]:
state_name_df = state_name_df.rename(columns = {'State' : 'StateDescName' , 'Code' : 'StateAbbrev'})
state_name_df.head()

  StateDescName StateAbbrev
0       Alabama          AL
1        Alaska          AK
2       Arizona          AZ
3      Arkansas          AR
4    California          CA

In [33]:
StateID = 0 
state_name_df.insert(StateID, "StateID", value = range(len(state_name_df)))
state_name_df.head()

   StateID StateDescName StateAbbrev
0        0       Alabama          AL
1        1        Alaska          AK
2        2       Arizona          AZ
3        3      Arkansas          AR
4        4    California          CA

In [34]:
# Create our session (link) from Python to the DB\
states = base.classes.states
session = Session(bind=engine)

connection = engine.connect()
connection.execute( '''TRUNCATE TABLE sales_by_qtr CASCADE; TRUNCATE TABLE states CASCADE''' )
connection.close()

In [35]:
############## HEY DUMMY - YOU MUST RUN THIS CODE ABOVE BEFORE YOU RUN THIS CODE BELOW #################

In [36]:
state_name_df.to_sql('states',engine, if_exists='append',index=False)

In [37]:
session.query(states).count()

51

### NOW FOR THE CENSUS

In [38]:
# Read in raw data
census_df=pd.read_csv("../DataSets/Census data.csv")
census_df.head()

,SUMLEV,REGION,DIVISION,STATE,NAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,POPESTIMATE2011,POPESTIMATE2012,...,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015,RNETMIG2016,RNETMIG2017,RNETMIG2018,RNETMIG2019,RNETMIG2020
0,10,0,0,0,United States,308745538,308758105,309327143,311583481,313877662,...,2.561705,2.745929,2.697816,2.980977,3.317393,3.308478,2.926260,2.208328,1.735857,1.450346
1,20,1,0,0,Northeast Region,55317240,55318414,55380764,55608318,55782661,...,0.951355,0.022910,-0.406301,-0.904675,-2.011990,-2.436197,-1.773545,-2.008364,-3.160710,-3.674490
2,20,2,0,0,Midwest Region,66927001,66929737,66975328,67164092,67348275,...,-0.883842,-0.895516,0.062390,-0.697566,-1.320504,-1.176126,-0.487257,-0.800567,-1.205668,-2.011623
3,20,3,0,0,South Region,114555744,114563042,114869421,116019483,117264196,...,5.218129,5.934440,5.373447,6.236211,7.355913,7.220696,6.272594,5.291755,5.479642,5.743507
4,20,4,0,0,West Region,71945553,71946912,72101630,72791588,73482530,...,2.752027,3.083047,3.183793,4.039593,5.004949,5.284859,4.022332,2.968883,1.822074,1.214309

In [39]:
# Drop columns we do not need
census_df=census_df.drop({'SUMLEV' , 'REGION' , 'DIVISION' , 'CENSUS2010POP' , 'ESTIMATESBASE2010' , 'POPESTIMATE2010' , 'POPESTIMATE2011' , 'POPESTIMATE2012' , 'POPESTIMATE2013' , 'POPESTIMATE2014' , 
                         'POPESTIMATE2015' , 'POPESTIMATE2016' , 'POPESTIMATE2017' , 'NPOPCHG_2010' , 'NPOPCHG_2011' , 'NPOPCHG_2012' , 'NPOPCHG_2013' , 'NPOPCHG_2014' , 'NPOPCHG_2015' , 'NPOPCHG_2016' , 
                         'NPOPCHG_2017' , 'NPOPCHG_2018' , 'NPOPCHG_2019' , 'NPOPCHG_2020' , 'BIRTHS2010' , 'BIRTHS2011' , 'BIRTHS2012' , 'BIRTHS2013' , 'BIRTHS2014' , 'BIRTHS2015' , 'BIRTHS2016' , 'BIRTHS2017' , 
                          'BIRTHS2018' , 'BIRTHS2019' , 'BIRTHS2020' , 'DEATHS2010' , 'DEATHS2011' , 'DEATHS2012' , 'DEATHS2013' , 'DEATHS2014' , 'DEATHS2015' , 'DEATHS2016' , 'DEATHS2017' , 'DEATHS2018' , 'DEATHS2019' , 
                          'DEATHS2020' , 'NATURALINC2010' , 'NATURALINC2011' , 'NATURALINC2012' ,  'NATURALINC2013' ,  'NATURALINC2014' ,  'NATURALINC2015' ,  'NATURALINC2016' ,  'NATURALINC2017' ,  'NATURALINC2018' , 
                          'NATURALINC2019' ,  'NATURALINC2020' , 'INTERNATIONALMIG2010' , 'INTERNATIONALMIG2011' , 'INTERNATIONALMIG2012' , 'INTERNATIONALMIG2013' , 'INTERNATIONALMIG2014' , 'INTERNATIONALMIG2015' , 
                         'INTERNATIONALMIG2016' , 'INTERNATIONALMIG2017' , 'INTERNATIONALMIG2018' , 'INTERNATIONALMIG2019' , 'INTERNATIONALMIG2020' , 'DOMESTICMIG2010' , 'DOMESTICMIG2011' , 'DOMESTICMIG2012' , 'DOMESTICMIG2013' , 
                         'DOMESTICMIG2014' , 'DOMESTICMIG2015' , 'DOMESTICMIG2016' , 'DOMESTICMIG2017' , 'DOMESTICMIG2018' , 'DOMESTICMIG2019' , 'DOMESTICMIG2020' , 'NETMIG2010' , 'NETMIG2011' , 'NETMIG2012' , 'NETMIG2013' ,
                         'NETMIG2014' , 'NETMIG2015' , 'NETMIG2016' , 'NETMIG2017' , 'NETMIG2018' , 'NETMIG2019' , 'NETMIG2020' , 'RESIDUAL2010' ,  'RESIDUAL2011' , 'RESIDUAL2012' , 'RESIDUAL2013' , 'RESIDUAL2014' , 
                         'RESIDUAL2015' , 'RESIDUAL2016' , 'RESIDUAL2017' , 'RESIDUAL2018' , 'RESIDUAL2019' , 'RESIDUAL2020' ,  'RBIRTH2011' , 'RBIRTH2012' , 'RBIRTH2013' , 'RBIRTH2014' , 'RBIRTH2015' , 'RBIRTH2016' , 'RBIRTH2017' , 
                         'RBIRTH2018' ,  'RBIRTH2019' , 'RBIRTH2020' , 'RDEATH2011' ,  'RDEATH2012' , 'RDEATH2013' , 'RDEATH2014' , 'RDEATH2015' , 'RDEATH2016' , 'RDEATH2017' , 'RDEATH2018' , 'RDEATH2019' , 'RDEATH2020' , 
                         'RNATURALINC2011' , 'RNATURALINC2012' , 'RNATURALINC2013' , 'RNATURALINC2014' ,  'RNATURALINC2015' ,  'RNATURALINC2016' , 'RNATURALINC2017' , 'RNATURALINC2018' , 'RNATURALINC2019' , 'RNATURALINC2020' ,
                         'RINTERNATIONALMIG2011' , 'RINTERNATIONALMIG2012' , 'RINTERNATIONALMIG2013' , 'RINTERNATIONALMIG2014' , 'RINTERNATIONALMIG2015' , 'RINTERNATIONALMIG2016' , 'RINTERNATIONALMIG2017' , 'RINTERNATIONALMIG2018' ,
                         'RINTERNATIONALMIG2019' , 'RINTERNATIONALMIG2020' , 'RDOMESTICMIG2011' ,  'RDOMESTICMIG2012' , 'RDOMESTICMIG2013' ,  'RDOMESTICMIG2014' , 'RDOMESTICMIG2015' , 'RDOMESTICMIG2016' , 'RDOMESTICMIG2017' ,
                         'RDOMESTICMIG2018' , 'RDOMESTICMIG2019' , 'RDOMESTICMIG2020' , 'RNETMIG2011' , 'RNETMIG2012' , 'RNETMIG2013' , 'RNETMIG2014' , 'RNETMIG2015' , 'RNETMIG2016' , 'RNETMIG2017' , 'RNETMIG2018' , 'RNETMIG2019' , 
                         'RNETMIG2020'},1)
                    

census_df.head()

   STATE              NAME  POPESTIMATE2018  POPESTIMATE2019  POPESTIMATE2020
0      0     United States        326838199        328329953        329484123
1      0  Northeast Region         56084543         56002934         55849869
2      0    Midwest Region         68263019         68340091         68316744
3      0      South Region        124649156        125686544        126662754
4      0       West Region         77841481         78300384         78654756

In [40]:
# Drop Regional Rows, US row, and Puerto Rico row
census_df = census_df.drop([ census_df.index[0] , census_df.index[1] , census_df.index[2] , census_df.index[3] , census_df.index[4] , census_df.index[56] ])
census_df.head()

   STATE        NAME  POPESTIMATE2018  POPESTIMATE2019  POPESTIMATE2020
5      1     Alabama          4891628          4907965          4921532
6      2      Alaska           736624           733603           731158
7      4     Arizona          7164228          7291843          7421401
8      5    Arkansas          3012161          3020985          3030522
9      6  California         39437463         39437610         39368078

In [41]:
# Rename columns to match the other tables, and add in a total population column
census_df = census_df.rename(columns = {'NAME' : 'StateDescName' , 'POPESTIMATE2018' : '2018Pop' , 'POPESTIMATE2019' : '2019Pop' , 'POPESTIMATE2020' : '2020Pop' })
census_df['TotalPop'] = census_df['2018Pop'] + census_df['2019Pop'] + census_df['2020Pop']
census_df = census_df.drop('STATE' ,1)
census_df.head()

  StateDescName   2018Pop   2019Pop   2020Pop   TotalPop
5       Alabama   4891628   4907965   4921532   14721125
6        Alaska    736624    733603    731158    2201385
7       Arizona   7164228   7291843   7421401   21877472
8      Arkansas   3012161   3020985   3030522    9063668
9    California  39437463  39437610  39368078  118243151

In [42]:
# Re-set index
census_df.reset_index(drop=True, inplace=True)

In [43]:
census_df["StateID"] = ""
census_df.head()

  StateDescName   2018Pop   2019Pop   2020Pop   TotalPop StateID
0       Alabama   4891628   4907965   4921532   14721125
1        Alaska    736624    733603    731158    2201385
2       Arizona   7164228   7291843   7421401   21877472
3      Arkansas   3012161   3020985   3030522    9063668
4    California  39437463  39437610  39368078  118243151

In [44]:
#This confirms that both DF are in same order
census_df["StateNameMatch"] = np.where(census_df['StateDescName'] == state_name_df['StateDescName'], 'True' , 'False')
census_df.head()

,StateDescName,2018Pop,2019Pop,2020Pop,TotalPop,StateID,StateNameMatch
0,Alabama,4891628,4907965,4921532,14721125,,True
1,Alaska,736624,733603,731158,2201385,,True
2,Arizona,7164228,7291843,7421401,21877472,,True
3,Arkansas,3012161,3020985,3030522,9063668,,True
4,California,39437463,39437610,39368078,118243151,,True

In [45]:
# Now that you know both DFs match row per row, assign StateID for census from StateID for states
census_df["StateID"] = state_name_df["StateID"]
census_df.head()

,StateDescName,2018Pop,2019Pop,2020Pop,TotalPop,StateID,StateNameMatch
0,Alabama,4891628,4907965,4921532,14721125,0,True
1,Alaska,736624,733603,731158,2201385,1,True
2,Arizona,7164228,7291843,7421401,21877472,2,True
3,Arkansas,3012161,3020985,3030522,9063668,3,True
4,California,39437463,39437610,39368078,118243151,4,True

In [46]:
# Drop the StatesNameMatch
census_df = census_df.drop('StateNameMatch' ,1)
census_df.head()

  StateDescName   2018Pop   2019Pop   2020Pop   TotalPop  StateID
0       Alabama   4891628   4907965   4921532   14721125        0
1        Alaska    736624    733603    731158    2201385        1
2       Arizona   7164228   7291843   7421401   21877472        2
3      Arkansas   3012161   3020985   3030522    9063668        3
4    California  39437463  39437610  39368078  118243151        4

In [47]:
# Add in column for CensusID
CensusID = 0
census_df.insert(CensusID, "CensusID", value = range(len(census_df)))
census_df.head()

   CensusID StateDescName   2018Pop   2019Pop   2020Pop   TotalPop  StateID
0         0       Alabama   4891628   4907965   4921532   14721125        0
1         1        Alaska    736624    733603    731158    2201385        1
2         2       Arizona   7164228   7291843   7421401   21877472        2
3         3      Arkansas   3012161   3020985   3030522    9063668        3
4         4    California  39437463  39437610  39368078  118243151        4

In [48]:
# Re-org so that columns in same order as SQL table
census_df = census_df [["CensusID" , "StateID" , "2018Pop" , "2019Pop" , "2020Pop", "TotalPop"]]
census_df.head()

   CensusID  StateID   2018Pop   2019Pop   2020Pop   TotalPop
0         0        0   4891628   4907965   4921532   14721125
1         1        1    736624    733603    731158    2201385
2         2        2   7164228   7291843   7421401   21877472
3         3        3   3012161   3020985   3030522    9063668
4         4        4  39437463  39437610  39368078  118243151

In [49]:
# Create our session (link) from Python to the DB\
census = base.classes.census
session = Session(bind=engine)

connection = engine.connect()
connection.execute( '''TRUNCATE TABLE mass_raw; TRUNCATE TABLE census''' )
connection.close()

In [50]:
############## HEY DUMMY - YOU MUST RUN THIS CODE ABOVE BEFORE YOU RUN THIS CODE BELOW #################

In [51]:
census_df.to_sql('census',engine, if_exists='append',index=False)

In [52]:
session.query(census).count()

51